In [8]:
def look():
    print('Correct')

In [10]:
look()

Correct

In [11]:
def GenZ():
    print('Ruto Must Go')

GenZ()

Ruto Must Go

In [12]:
def add(a,b):
    result=a+b
    print(result)
    return result
add(2,3)

5

5

In [16]:
max(10,13,14)

14

In [17]:
len("Stacy")

5

In [18]:
type(5)

int

In [19]:
type(True)

bool

In [20]:
myList=[1,2,3]
print(myList[0])

1

In [21]:
grocery=['wiu', 'tomatoes','onions']
grocery[1]

'tomatoes'

In [23]:
x=0
for item in grocery:
    print(item)
print(grocery)

wiu
tomatoes
onions
['wiu', 'tomatoes', 'onions']

In [30]:
grocery=['wiu', 'tomatoes','onions']
ind=0
for item in grocery:
    if item=='onions':
        grocery[ind]='Kitungu'
    ind=ind+1
print(grocery)

['Kitungu', 'tomatoes', 'onions']

In [27]:
grocery[2]='cabbage'

In [28]:
grocery[2]

'cabbage'

In [31]:
grocery.append('spinach')
print(grocery)

['Kitungu', 'tomatoes', 'onions', 'spinach']

In [10]:
def checker(a):
    if a%2==0:
        print('even')
    else:
        print('odd')
checker(4)

even

In [11]:
numbers=[2,3,9,8,6]
ind=0
for item in numbers:
    if item%2==0:
        print('even')
    else:
        print('odd')

even
odd
odd
even
even

In [15]:
numbers=[]
for x in range(5):
    numbers.append(int(input('Enter a number')))
print(numbers)

Enter a number 67
Enter a number 78
Enter a number 89
Enter a number 56
Enter a number 56

[67, 78, 89, 56, 56]

In [18]:
x='Brian'
y='Ken'
if x[0]==y[0]:
     print('True')
else:
    print('False')

False

In [26]:
def numberChecker(b):
    for item in b:
        if item%2==0:
            print('even')
        else:
            print('odd') 

numbers=[]
for x in range(5):
    numbers.append(int(input('Enter a number')))
print(numbers)
numberChecker(numbers)

Enter a number 78
Enter a number 89
Enter a number 56
Enter a number 90
Enter a number 57

[78, 89, 56, 90, 57]
even
odd
even
even
odd

In [35]:
num = []
for x in range(2):
    num.append(int(input("enter number")))
    print(num)
    
y= max(num)
z = sum([y,10])
print(z)
print(y)

enter number 67

[67]

enter number 90

[67, 90]
100
90

In [37]:
#dictionary
data={
    'name':'Darlsy',
    'age':35,
    'salary':400
}
print(data)

{'name': 'Darlsy', 'age': 35, 'salary': 400}

In [38]:
data={
    'name':['Darlsy', 'Kevin', 'Indas', 'Persun'],
    'age':[35, 100, 34, 67],
    'salary':[400, 500,560,754]
}
print(data)

{'name': ['Darlsy', 'Kevin', 'Indas', 'Persun'], 'age': [35, 100, 34, 67], 'salary': [400, 500, 560, 754]}

In [39]:
data

{'name': ['Darlsy', 'Kevin', 'Indas', 'Persun'],
 'age': [35, 100, 34, 67],
 'salary': [400, 500, 560, 754]}

In [42]:
data['location']=['Mombasa','Kisumu','Nakuru','Homabay']

In [41]:
data

{'name': ['Darlsy', 'Kevin', 'Indas', 'Persun'],
 'age': [35, 100, 34, 67],
 'salary': [400, 500, 560, 754]}

In [43]:
data

{'name': ['Darlsy', 'Kevin', 'Indas', 'Persun'],
 'age': [35, 100, 34, 67],
 'salary': [400, 500, 560, 754],
 'location': ['Mombasa', 'Kisumu', 'Nakuru', 'Homabay']}

In [44]:
del data['location']

In [45]:
data

{'name': ['Darlsy', 'Kevin', 'Indas', 'Persun'],
 'age': [35, 100, 34, 67],
 'salary': [400, 500, 560, 754]}

In [48]:
for key,value in data.items():
    print(key,value)

name ['Darlsy', 'Kevin', 'Indas', 'Persun']
age [35, 100, 34, 67]
salary [400, 500, 560, 754]

In [51]:
import pandas as pd

In [53]:
df=pd.DataFrame(data)

In [54]:
df

     name  age  salary
0  Darlsy   35     400
1   Kevin  100     500
2   Indas   34     560
3  Persun   67     754

In [55]:
df['name']

0    Darlsy
1     Kevin
2     Indas
3    Persun
Name: name, dtype: object

In [56]:
df[['name','age']]

     name  age
0  Darlsy   35
1   Kevin  100
2   Indas   34
3  Persun   67

In [58]:
df['age']+1

0     36
1    101
2     35
3     68
Name: age, dtype: int64

In [63]:
df.dtypes

name      object
age        int64
salary     int64
dtype: object

In [64]:
df['age']=df['age']+1

In [65]:
df

     name  age  salary
0  Darlsy   36     400
1   Kevin  101     500
2   Indas   35     560
3  Persun   68     754

In [71]:
df['age'], df['salary']=df['age']+1, df['salary']+500

In [72]:
df

     name  age  salary
0  Darlsy   37     900
1   Kevin  102    1000
2   Indas   36    1060
3  Persun   69    1254

In [75]:
df[['name','age']]

     name  age
0  Darlsy   37
1   Kevin  102
2   Indas   36
3  Persun   69

In [2]:
#Assignment 1
students={
    'Name':['Kevin','Samuel','Samson','Caroline','Hellen'],
    'Math':[30,78,66,89,47],
    'Science':[78,90,43,90,23],
    'English':[56,78,45,56,66]
}

In [3]:
students

{'Name': ['Kevin', 'Samuel', 'Samson', 'Caroline', 'Hellen'],
 'Math': [30, 78, 66, 89, 47],
 'Science': [78, 90, 43, 90, 23],
 'English': [56, 78, 45, 56, 66]}

In [4]:
import pandas as river

In [5]:
table=river.DataFrame(students)

In [6]:
table

       Name  Math  Science  English
0     Kevin    30       78       56
1    Samuel    78       90       78
2    Samson    66       43       45
3  Caroline    89       90       56
4    Hellen    47       23       66

In [12]:
a=(30+78+56)/3
b=(78+90+78)/3
c=(66+43+45)/3
d=(89+90+56)/3
e=(47+23+66)/3

In [15]:
table['Average']=[a,b,c,d,e]

In [16]:
table

       Name  Math  Science  English    Average
0     Kevin    30       78       56  54.666667
1    Samuel    78       90       78  82.000000
2    Samson    66       43       45  51.333333
3  Caroline    89       90       56  78.333333
4    Hellen    47       23       66  45.333333

In [20]:
table.Average.max()

82.0

In [24]:
table.Average.sort_values(ascending=False)

1    82.000000
3    78.333333
0    54.666667
2    51.333333
4    45.333333
Name: Average, dtype: float64

In [26]:
#Assigment 2
DegTemp=[20,78,94,34,76]
FarTemp=[((y*9/5)+32) for y in DegTemp]

In [27]:
FarTemp

[68.0, 172.4, 201.2, 93.2, 168.8]